# GetRegionIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetRegionIds Method
CompoundStructure Class See Also
---
Gets the region ids of this compound structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<int> GetRegionIds()
```

Visual Basic
---
```text
Public Function GetRegionIds As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetRegionIds()
```

# ### Return Value
The ids of the regions defining this CompoundStructure.
# Remarks
A vertically compound structure consists of regions with polygonal boundaries.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is valid only for vertically compound structures. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace